tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'caskroom/cask'
tap 'homebrew/homebrew-php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install Binaries
brew 'fasd'
brew 'tree'
brew 'the_silver_searcher'
brew 'git'
brew 'hub'
brew 'mackup'
brew 'mas'    # Mac App Store CLI
brew 'wget'


# NODE.JS
brew 'node'
brew 'yarn'

# PHP
brew 'freetype'
brew 'jpeg'
brew 'libpng'
brew 'gd'
brew 'zlib'
brew 'php72'
brew 'php72-redis'
brew 'php72-xdebug'
brew 'php72-intl'
brew 'php72-imagick'
brew 'mariadb'
brew 'phpunit'
brew 'boris'
brew 'composer'
brew 'psysh'

# MacOS apps
cask 'aerial'
cask 'alfred'
cask 'bartender'
cask 'cyberduck'
cask 'daisydisk'
cask 'dash'
cask 'dropbox'
cask 'djay-pro'
cask 'google-chrome'
cask 'evernote'
cask 'fantastical'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'kaleidoscope'
cask 'keepingyouawake'
cask 'kindle'
cask 'microsoft-office'
cask 'moom'
cask 'mysqlworkbench'
cask 'onedrive'
cask 'quickbooks-online'
cask 'sequel-pro'
cask 'shuttle'
cask 'slack'
cask 'sketch'
cask 'sketchup'
cask 'sublime-text'
cask 'transmission'
cask 'tower'
cask 'viscosity'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'


