tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install Binaries
brew 'fasd'
brew 'tree'
brew 'the_silver_searcher'
# brew 'git'
brew 'hub'
# brew 'mackup'
# brew 'mas'    # Mac App Store CLI
brew 'wget'
brew 'bat'
brew 'graphviz'
brew 'tokei'
brew 'mkcert'

# NODE.JS
brew 'node'
brew 'pnpm'

# PHP
brew 'freetype'
brew 'jpeg'
brew 'libpng'
brew 'gd'
brew 'zlib'
brew 'php'
brew 'composer'
# brew 'mysql'
brew 'nginx'
# brew 'redis'
# brew 'mailhog'
brew 'svn'
brew 'spaceship'

# MacOS apps
#cask '1password'
# cask 'adobe-acrobat-reader'
# cask 'aerial'
#cask 'alfred'
cask 'appzapper'
#cask 'bartender'
# cask 'cyberduck'
cask 'daisydisk'
cask 'dash'
#cask 'dropbox'
#cask 'google-chrome'
# cask 'evernote'
#cask 'fantastical'
#cask 'i-stat-menus'
cask 'insomnia'
#cask 'iterm2'
#cask 'jetbrains-toolbox'
#cask 'kaleidoscope'
cask 'keepingyouawake'
# cask 'kindle'
#cask 'moom'
# cask 'mysqlworkbench'
#cask 'sequel-pro'
#cask 'slack'
# cask 'sketch'
#cask 'sketchup'
#cask 'sourcetree'
# cask 'sublime-text'
#cask 'visual-studio-code'
cask 'vlc'
# cask 'wkhtmltopdf'

# Quicklook
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'


